docs/theology/greek-study.tex
% Created 2025-05-30 Fri 12:34
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage[mathletters]{ucs}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.5in]{geometry}
\usepackage[LGR,T1]{fontenc}
\usepackage[utf8]{inputenc}
\usepackage{pmboxdraw}
\usepackage{newunicodechar}
\newunicodechar{└}{\textSFii}
\newunicodechar{├}{\textSFviii}
\newunicodechar{─}{\textSFx}
\documentclass[12pt]{article}
\usepackage{fontspec}
\setmainfont{DejaVu Serif}
\usepackage[greek, english, american]{babel}
\usepackage{alphabeta}
\author{Shane Mulligan}
\date{\textit{<2024-10-19 Sat>}}
\title{New Testament Greek study}
\hypersetup{
 pdfauthor={Shane Mulligan},
 pdftitle={New Testament Greek study},
 pdfkeywords={faith christianity},
 pdfsubject={},
 pdfcreator={Emacs 29.4.50 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\makeatletter
\renewcommand\verbatim@font\{\normalfont\fontencoding{T1}\ttfamily\}
\makeatother

\section{NT Greek study}
\label{sec:orgbd44c0d}

\subsection{Question}
\label{sec:orgbb34d1e}

I'd like to understand the Greek behind the phrase \uline{in the teaching of Christ}.
Because I'm interested in whether the phrase \uline{teaching of Christ} refers to the teachings that Christ
taught including His teachings before His death, burial and resurrection, or
if it the phrase is also talking about the doctrine surrounding what is known about Christ.
My guess is both, but I'd like to understand the Greek a bit better.

\begin{quote}
\textbf{II John 1:9} - Everyone who goes on ahead and does not abide \uline{in the teaching (\href{https://biblehub.com/greek/1321.htm}{G1322 didachē}) of Christ}, does not have God. Whoever abides in the teaching has both the Father and the Son. (ESV)
\end{quote}

\subsection{Didache}
\label{sec:org63f411f}
\begin{quote}
\textbf{Matthew 28:19-20} - Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, teaching (\href{https://biblehub.com/greek/1321.htm}{G1321 didaskontes}) them to observe all that I have commanded you. And behold, I am with you always, to the end of the age. (ESV)
\end{quote}

\begin{quote}
\textbf{II Timothy 4:3} - For the time is coming when people will not endure sound teaching (\href{https://biblehub.com/greek/1319.htm}{G1319 didaskalias}), but having itching ears they will accumulate for themselves teachers to suit their own passions, (ESV)
\end{quote}

\begin{quote}
\textbf{I Timothy 6:1} - Let all who are under a yoke as slaves regard their own masters as worthy of all honor, so that the name of God and the teaching (\href{https://biblehub.com/greek/1319.htm}{G1319 didaskalia}) may not be reviled. (ESV)
\end{quote}

\begin{quote}
\textbf{I Timothy 6:3} - If anyone teaches a different doctrine and does not agree with the sound words of our Lord Jesus Christ and the teaching (\href{https://biblehub.com/greek/1319.htm}{G1319 didaskalia}) that accords with godliness, (ESV)
\end{quote}

\begin{quote}
\textbf{Romans 6:17-18} - But thanks be to God, that you who were once slaves of sin have become obedient from the heart to the standard of teaching (\href{https://biblehub.com/greek/1322.htm}{G1322 didachēs}) to which you were committed, and, having been set free from sin, have become slaves of righteousness. (ESV)
\end{quote}

\begin{quote}
\textbf{John 7:16-17} - So Jesus answered them, My teaching (\href{https://biblehub.com/greek/1321.htm}{G1322 didachē}) is not mine, but his who sent me. If anyone's will is to do God's will, he will know whether the teaching is from God or whether I am speaking on my own authority. (ESV)
\end{quote}

\subsection{Logon - listened to His \underline{word/s} is a better translation here}
\label{sec:org1cc1ad3}
\begin{quote}
\textbf{Luke 10:39} - And she had a sister called Mary, who sat at the Lord's feet and listened to his teaching (\href{https://biblehub.com/greek/3056.htm}{G3056 logon}). (ESV)
\end{quote}

\subsection{Grammatical Case}
\label{sec:orgbeb102a}

\begin{verbatim}
 1  interrogative
 2      /ˌɪntəˈrɒɡətɪv/
 3      adjective
 4      having the force of a question.
 5      "a hard, interrogative stare"
 6  
 7  transitive verb
 8      A verb that entails one or more transitive
 9      objects, for example, 'enjoys' in Amadeus
10      enjoys music.
11  
12      This contrasts with intransitive verbs,
13      which do not entail transitive objects,
14      for example, 'arose' in Beatrice arose.
\end{verbatim}

Notes from \url{https://en.wikipedia.org/wiki/Grammatical\_case}:

\begin{itemize}
\item \textbf{N (Nominative)}
\begin{itemize}
\item \texttt{Indicates}: Subject of a finite verb
\item \texttt{Sample case words}: \uline{we}
\item \texttt{Sample sentence}: \uline{We} went to the store.
\item \texttt{Interrogative}: Who or what?
\item \texttt{Notes}: Corresponds to English's subject pronouns.
\end{itemize}
\item \textbf{V (Vocative)}
\begin{itemize}
\item \texttt{Indicates}: Addressee
\item \texttt{Sample case words}: \uline{John}
\item \texttt{Sample sentence}:
\begin{itemize}
\item \uline{John}, are you all right?
\item Hello, \uline{John}!
\item O John, how are you! (archaic)
\end{itemize}
\item \texttt{Interrogative}:
\item \texttt{Notes}: Roughly corresponds to the archaic use of "O" in English.
\end{itemize}
\item \textbf{A (Accusative)}
\begin{itemize}
\item \texttt{Indicates}: Direct object of a transitive verb
\item \texttt{Sample case words}: \uline{us}, \uline{for us}, \uline{the (object)}
\item \texttt{Sample sentence}:
\begin{itemize}
\item The clerk remembered \uline{us}.
\item John waited \uline{for us} at the bus stop.
\item Obey \uline{the law}.
\end{itemize}
\item \texttt{Interrogative}:
\begin{itemize}
\item Whom or what?
\end{itemize}
\item \texttt{Notes}: Corresponds to English's object pronouns and preposition for construction before the object, often marked by a definite article the. Together with dative, it forms modern English's oblique case.
\end{itemize}
\item \textbf{G (Genitive)}
\begin{itemize}
\item \texttt{Indicates}: Possessor of another noun
\item \texttt{Sample case words}: \uline{'s}, \uline{of (the)}
\item \texttt{Sample sentence}:
\begin{itemize}
\item \uline{John's} book was on the table.
\item The pages \uline{of the book} turned yellow.
\item The table is made \uline{out of wood}.
\end{itemize}
\item \texttt{Interrogative}: Whose? From what or what of?
\item \texttt{Notes}: Roughly corresponds to English's possessive (possessive determiners and pronouns) and preposition of construction.
\end{itemize}
\item \textbf{D (Dative)}
\begin{itemize}
\item \texttt{Indicates}: Indirect object of a verb
\item \texttt{Sample case words}: \uline{us}, \uline{to us}, \uline{to the (object)}
\item \texttt{Sample sentence}:
\begin{itemize}
\item The clerk gave \uline{us} a discount.
\item The clerk gave a discount \uline{to us}.
\item According \uline{to the law\ldots{}}
\end{itemize}
\item \texttt{Interrogative}: Whom or to what?
\item \texttt{Notes}: Corresponds to English's object pronouns and preposition to construction before the object, often marked by a definite article the. Together with accusative, it forms modern English's oblique case.
\end{itemize}
\end{itemize}

\subsubsection{Interlinear}
\label{sec:org6fdb697}

\begin{verbatim}
 1  3956    3588    4254           2532 3361 3306
 2  pas     ho      proagōn        kai  mē   menōn
 3  πᾶς     ὁ       προάγων        καὶ  μὴ   μένων
 4  Anyone   -      going on ahead and  not  abiding
 5  Adj-NMS Art-NMS V-PPA-NMS      Conj Adv  V-PPA-NMS
 6                        ┌─────────┐
 7  1722 3588    1322     │ 3588    │ 5547       2316
 8  en   tē      didachē  │ tou     │ Christou   Theon
 9  ἐν   τῇ      διδαχῇ   │ τοῦ     │ Χριστοῦ  , Θεὸν
10  in   the     teaching │  -      │ of Christ  God
11  Prep Art-DFS N-DFS    │ Art-GMS │ N-GMS      N-AMS
12                        └─────────┘
13  3756 2192     3588      3306      1722 3588
14  ouk  echei    ho        menōn     en   tē
15  οὐκ  ἔχει  .  ὁ         μένων     ἐν   τῇ
16  not  has      The [one] abiding   in   the
17  Adv  V-PIA-3S Art-NMS   V-PPA-NMS Prep Art-DFS
18  
19  1322      3778       2532 3588    3962
20  didachē   houtos     kai  ton     Patera
21  διδαχῇ  , οὗτος      καὶ  τὸν     Πατέρα
22  teaching  this [one] both the     Father
23  N-DFS     DPro-NMS   Conj Art-AMS N-AMS
24  
25  2532 3588    5207  2192
26  kai  ton     Huion echei
27  καὶ  τὸν     Υἱὸν  ἔχει  .
28  and  the     Son   has
29  Conj Art-AMS N-AMS V-PIA-3S
\end{verbatim}

\subsubsection{Example - Art-GMS}
\label{sec:org655b794}
\url{https://biblehub.com/interlinear/2\_john/1-9.htm}

\begin{verbatim}
1  tou
2  3588
3  tou
4  τοῦ
5   -
6  Art-GMS
\end{verbatim}

\begin{itemize}
\item G - \href{https://en.wikipedia.org/wiki/Grammatical\_case}{Genitive}
\item M - \href{https://en.wikipedia.org/wiki/Grammatical\_case}{Masculine}
\item S - \href{https://en.wikipedia.org/wiki/Grammatical\_case}{Singular}
\end{itemize}
\end{document}
